<a href="https://colab.research.google.com/github/adarshnitt/Titanic-Survival-Prediction/blob/main/ML_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Steps**


*  Link  Colab and Kaggle
*  Import train ,Test Data from Kaggle 
*   Model Definition



```
# This is formatted as code
```

**<h1> Titanic: Predict Survival on Titanic </h1>**   

---

In [1]:
# installing kaggle
! pip install -q kaggle
# successfully kaggle linked with colab

In [14]:
# uploading file from system
from google.colab import files 
files.upload()
# note: json file- Kaglle/account/API_token

Saving kaggle.json to kaggle.json

{'kaggle.json': b'{"username":"adarshnitt","key":"fbcce4c42063f6f11a4295551e95cd61"}'}

In [12]:
# making folder to store our data
! mkdir  ~/.kaggle

mkdir: cannot create directory ‘/root/.kaggle’: File exists

In [15]:
# copy path of imported file kaggle.json to our newly forlder
! cp kaggle.json  ~/.kaggle/

In [16]:
! ~/.kaggle

/bin/bash: /root/.kaggle: Is a directory

In [17]:
# trial
! mkdir ~/adarsh

mkdir: cannot create directory ‘/root/adarsh’: File exists

In [18]:
# listing all datsets avialable in kaggle
! kaggle datasets list

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.12 / client 1.5.4)
ref                                                         title                                              size  lastUpdated          downloadCount
----------------------------------------------------------  ------------------------------------------------  -----  -------------------  -------------
gpreda/reddit-vaccine-myths                                 Reddit Vaccine Myths                              233KB  2021-09-03 10:07:19          11840
crowww/a-large-scale-fish-dataset                           A Large Scale Fish Dataset                          3GB  2021-04-28 17:03:01           7202
imsparsh/musicnet-dataset                                   MusicNet Dataset                                   22GB  2021-02-18 14:12:19           2812
dhruvildave/wikibooks-dataset                               Wikibooks Dataset                                   2GB  2021-07-03 18:37:20           2845
nickuzmenkov/nih-chest-xrays-tfrecords                      NIH Chest X-rays TFRecords                         11GB  2021-03-09 04:49:23           1081
promptcloud/careerbuilder-job-listing-2020                  Careerbuilder Job Listing 2020                     42MB  2021-03-05 06:59:52           1831
mathurinache/twitter-edge-nodes                             Twitter Edge Nodes                                342MB  2021-03-08 06:43:04            886
fatiimaezzahra/famous-iconic-women                          Famous Iconic Women                               838MB  2021-02-28 14:56:00           1315
simiotic/github-code-snippets                               GitHub Code Snippets                                7GB  2021-03-03 11:34:39            322
alsgroup/end-als                                            End ALS Kaggle Challenge                           12GB  2021-04-08 12:16:37            878
coloradokb/dandelionimages                                  DandelionImages                                     4GB  2021-02-19 20:03:47            771
mathurinache/the-lj-speech-dataset                          The LJ Speech Dataset                               3GB  2021-02-15 09:19:54            326
landrykezebou/lvzhdr-tone-mapping-benchmark-dataset-tmonet  LVZ-HDR Tone Mapping Benchmark Dataset (TMO-Net)   24GB  2021-03-01 05:03:40            184
stuartjames/lights                                          LightS: Light Specularity Dataset                  18GB  2021-02-18 14:32:26            139
nickuzmenkov/ranzcr-clip-kfold-tfrecords                    RANZCR CLiP KFold TFRecords                         2GB  2021-02-21 13:29:51            127
imsparsh/accentdb-core-extended                             AccentDB - Core & Extended                          6GB  2021-02-17 14:22:54            138
datasnaek/youtube-new                                       Trending YouTube Video Statistics                 201MB  2019-06-03 00:56:47         149034
residentmario/ramen-ratings                                 Ramen Ratings                                      40KB  2018-01-11 16:04:39          26639
zynicide/wine-reviews                                       Wine Reviews                                       51MB  2017-11-27 17:08:04         143225
datasnaek/chess                                             Chess Game Dataset (Lichess)                        3MB  2017-09-04 03:09:09          21476

In [19]:
# altering permission of /.kaggle
! chmod 600 ~/.kaggle/kaggle.json

**Step: Import Train, Test data From Kaggle**

In [20]:
# mounting any competionn data by visiting cometion and copy data api under data column in competition
# i am using data api of competiton " 30 day of ml"
#! api
! kaggle competitions download -c titanic
 # successfully adat is available under /content

Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.12 / client 1.5.4)
Downloading test.csv to /content
  0% 0.00/28.0k [00:00<?, ?B/s]
100% 28.0k/28.0k [00:00<00:00, 23.8MB/s]
Downloading gender_submission.csv to /content
  0% 0.00/3.18k [00:00<?, ?B/s]
100% 3.18k/3.18k [00:00<00:00, 3.46MB/s]
Downloading train.csv to /content
  0% 0.00/59.8k [00:00<?, ?B/s]
100% 59.8k/59.8k [00:00<00:00, 48.8MB/s]

In [21]:
import pandas as pd

In [250]:
train=pd.read_csv(r"/content/train.csv")
test=pd.read_csv(r"/content/test.csv")

In [115]:
train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [118]:
y=train["Survived"]

In [251]:
x=train.drop(["Survived"],axis=1)

In [252]:
x

     PassengerId  Pclass  ... Cabin Embarked
0              1       3  ...   NaN        S
1              2       1  ...   C85        C
2              3       3  ...   NaN        S
3              4       1  ...  C123        S
4              5       3  ...   NaN        S
..           ...     ...  ...   ...      ...
886          887       2  ...   NaN        S
887          888       1  ...   B42        S
888          889       3  ...   NaN        S
889          890       1  ...  C148        C
890          891       3  ...   NaN        Q

[891 rows x 11 columns]

**Step: MAchine Learning Model Defining**

In [121]:
# Impute values collectively in a datstet
from sklearn.impute import SimpleImputer
import numpy as np

In [253]:
si=SimpleImputer(missing_values=np.nan,strategy="mean")   # impute all nan values in data once
x_num=pd.DataFrame(si.fit_transform(x.select_dtypes(exclude=["object"])),columns=x.select_dtypes(exclude=(["object"])).columns)

In [254]:
# catregorical encoding to numeriacl valyes
from sklearn.preprocessing import LabelEncoder  
x_cat=x.select_dtypes(include=["object"])
le=LabelEncoder()

In [255]:
x_cat.isnull().sum()

Name          0
Sex           0
Ticket        0
Cabin       687
Embarked      2
dtype: int64

In [256]:
x_num.isnull().sum()

PassengerId    0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
dtype: int64

In [257]:
si=SimpleImputer(missing_values=np.nan,strategy="most_frequent")   # impute all nan values in data once
x_cat_impute=pd.DataFrame(si.fit_transform(x.select_dtypes(include=["object"])),columns=x.select_dtypes(include=(["object"])).columns)

In [258]:
# categorical encoding
cat_col=trainc.columns
from sklearn.preprocessing import OneHotEncoder
oe=OneHotEncoder(handle_unknown='ignore',sparse=False)
x_cat_impute_onehot=pd.DataFrame(oe.fit_transform(x_cat_impute))

In [259]:
from sklearn.preprocessing import OrdinalEncoder  # same as LabelEncoder
#oe=OrdinalEncoder(handle_unknown="use_encoded_value",unknown_value=np.nan)
#oe.fit_transform(data.select_dtypes(include=["object"]))

In [174]:
import numpy as np
import numpy as np
from scipy import stats

In [260]:
# standard scaler   # put dqta with zero mean and 1 variance.
from sklearn.preprocessing import StandardScaler   # it normalize data in row direction
se=StandardScaler(copy=False)
x_num_standardsclr=pd.DataFrame(se.fit_transform(x_num.select_dtypes(exclude=["object"])),columns=x_num.select_dtypes(exclude=["object"]).columns)

In [178]:
from sklearn.preprocessing import MinMaxScaler # rescale vlaues in user min_max range

In [261]:
from sklearn.preprocessing import MinMaxScaler  # rescale data in range of feature_range(min,Max)
mx=MinMaxScaler(feature_range=(1,100))
pd.DataFrame(mx.fit_transform(x_num.select_dtypes(exclude=["object"])),columns=x_num.select_dtypes(exclude=["object"]).columns)   # min max scaling numerical data

     PassengerId  Pclass        Age   SibSp  Parch       Fare
0       1.000000   100.0  27.846193  13.375    1.0   2.400955
1       1.111236     1.0  47.750691  13.375    1.0  14.774438
2       1.222472   100.0  32.822317   1.000    1.0   2.531388
3       1.333708     1.0  44.018598  13.375    1.0  11.260785
4       1.444944   100.0  44.018598   1.000    1.0   2.555543
..           ...     ...        ...     ...    ...        ...
886    99.555056    50.5  34.066348   1.000    1.0   3.512057
887    99.666292     1.0  24.114099   1.000    1.0   6.797054
888    99.777528   100.0  37.424135  13.375   34.0   5.531364
889    99.888764     1.0  32.822317   1.000    1.0   6.797054
890   100.000000   100.0  40.286504   1.000    1.0   2.497572

[891 rows x 6 columns]

In [262]:
# pipeline
from sklearn.pipeline import Pipeline
num_data=x.select_dtypes(exclude=["object"]).columns
from sklearn.impute import SimpleImputer
impute=SimpleImputer(missing_values=np.nan,strategy="mean")
cat_data=x.select_dtypes(include=["object"]).columns
from sklearn.preprocessing import LabelEncoder
encode=LabelEncoder()

In [285]:
from sklearn.preprocessing import OneHotEncoder
oe=OneHotEncoder(handle_unknown='ignore',sparse=False)

In [288]:

# pipeline formation for cat data 
cat_data_process=Pipeline(steps=[
    ("imputation",SimpleImputer(strategy="most_frequent")),
    ("LabelREncode",oe)
])
#Pipeline formatio for num data
num_data_process=Pipeline(steps=[
    ("Imputer",SimpleImputer(strategy="mean"))
])
# column transformation                              # categorical columns ke liye cat_data transform karna aur numerical data ke liye num_data transform karna.
from sklearn.compose import ColumnTransformer
preprocess=ColumnTransformer(transformers=[
    ("numerical_data",num_data_process,list(num_data)),
    ("categorical_data",cat_data_process,list(cat_data))])
# 1- Impute values with most frequent
# 2- Encode categoriacl values with 
"""pipeline(steps=[(1-Imputer),(2-LabelEncoder)])"""

'pipeline(steps=[(1-Imputer),(2-LabelEncoder)])'

In [289]:
y=pd.DataFrame(y,columns=["Survived"])

In [290]:
from sklearn.tree import DecisionTreeClassifier
model=DecisionTreeClassifier()
project1=Pipeline(steps=[
    ("preprocess",preprocess),
    ("model",model)
])
from sklearn.model_selection import train_test_split
trainx,valx,trainy,valy=train_test_split(x,y,train_size=0.8)
project1.fit(x,y)

Pipeline(memory=None,
         steps=[('preprocess',
                 ColumnTransformer(n_jobs=None, remainder='drop',
                                   sparse_threshold=0.3,
                                   transformer_weights=None,
                                   transformers=[('numerical_data',
                                                  Pipeline(memory=None,
                                                           steps=[('Imputer',
                                                                   SimpleImputer(add_indicator=False,
                                                                                 copy=True,
                                                                                 fill_value=None,
                                                                                 missing_values=nan,
                                                                                 strategy='mean',
                                                                                 verbose=0))],
                                                           verbose=False),
                                                  ['PassengerId', 'Pclas...
                                                   'Cabin', 'Embarked'])],
                                   verbose=False)),
                ('model',
                 DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None,
                                        criterion='gini', max_depth=None,
                                        max_features=None, max_leaf_nodes=None,
                                        min_impurity_decrease=0.0,
                                        min_impurity_split=None,
                                        min_samples_leaf=1, min_samples_split=2,
                                        min_weight_fraction_leaf=0.0,
                                        presort='deprecated', random_state=None,
                                        splitter='best'))],
         verbose=False)

In [292]:
prediction=project1.predict(test)

In [281]:
x

     PassengerId  Pclass  ... Cabin Embarked
0              1       3  ...   NaN        S
1              2       1  ...   C85        C
2              3       3  ...   NaN        S
3              4       1  ...  C123        S
4              5       3  ...   NaN        S
..           ...     ...  ...   ...      ...
886          887       2  ...   NaN        S
887          888       1  ...   B42        S
888          889       3  ...   NaN        S
889          890       1  ...  C148        C
890          891       3  ...   NaN        Q

[891 rows x 11 columns]

In [276]:
test

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [294]:
from sklearn.metrics import mean_absolute_error
from sklearn.feature_selection import mutual_info_regression  #   useful to choose most used feature for regression outout.

0.43333333333333335